{
    "title": "Commission's Rules of Practice",
    "type": "Rule",
    "date": "September 19, 2025",
    "url": "https://www.govinfo.gov/content/pkg/FR-2025-09-19/pdf/2025-18237.pdf",
    "summary": "Big picture: the Securities and Exchange Commission changed some internal procedures to keep securities offerings on schedule, and it clarified that it won’t slow down a company’s registration simply because the company uses a mandatory arbitration clause for investor disputes. Both changes take effect September 19, 2025.\n\nFirst, the Commission updated its review process so that certain staff decisions—like declaring a registration statement effective or qualifying an offering statement under Regulation A, including later amendments—won’t be automatically put on hold just because someone asks the Commission to review them or a single Commissioner calls them up for review. Instead, the Commission will decide case by case whether a pause is warranted. The goal is to avoid last‑minute disruptions after sales have begun, which can raise costs, inject uncertainty, and sometimes jeopardize a deal. The Commission kept its enforcement backstops: it can still block or suspend an offering or exemption if investor protection calls for it.\n\nSecond, the Commission said that a company’s use of a mandatory arbitration provision for investor claims under federal securities laws will not, by itself, affect whether staff accelerates the effective date of a registration statement. Staff will continue to focus on whether the filing clearly and completely discloses material information, including plain‑English disclosure about any arbitration requirement. The statement reflects recent court decisions that have generally supported arbitration agreements unless Congress has clearly said otherwise.\n\nWho benefits? Companies—and their underwriters and selling shareholders—gain more predictable timing, which can be critical when markets move fast. Investors may also benefit from smoother execution and clearer expectations about timing and disclosure, especially in smaller offerings that rely on Regulation A.\n\nWho might be negatively affected? People who want to challenge a staff decision may find it harder to pause an offering automatically while the Commission considers their concerns. Some investor advocates worry that eliminating automatic stays could let problematic offerings proceed longer before being halted, and that allowing offerings with mandatory arbitration to move forward quickly could make it harder for investors to bring claims in court. The Commission’s view is that it retains the tools to intervene when needed and that these changes are about process and timing, not loosening investor protections."
}